برخی از مهمترین دیزاین پترنهای مورد استفاده:

-	برای تمام توابع، متغیرها و آرایه ها نامهای کاملی انتخاب شده که نشان دهنده مفهوم آنها باشد

-	تمام flag ها که بصورت Boolean تعریف می شوند با عبارت is شروع می شوند.

-	نام تمام توابع، متغیرها و آرایه هایی که به نحوی مرتبط با پیشنهاد فنی هستند شامل کلمه proposal هستند

-	نام تمام توابع، متغیرها و آرایه هایی که به نحوی مرتبط با پیشنهاد قیمت هستند شامل کلمه price هستند

-	نام تمام توابع، متغیرها و آرایه هایی که به نحوی مرتبط با مقادیر هش شده هستند شامل کلمه hash یا hashed هستند

-	نام تمام توابع، متغیرها و آرایه هایی که به نحوی مرتبط با مقادیر واقعی هستند که قبلا هش آنها ارسال شده، شامل کلمه reveal یا revealed هستند

-	در event ها، آدرس ولت فراخوانی کننده index شده است تا جستجو را راحت تر کند.

-	تلاش شده برای تمام خطاها پیام مناسبی صادر شود تا دلیل revert شدن تراکنش مشخص باشد. برای خطاها revert با پیام مناسب اتفاق می افتد و برای اتمام موفقیت آمیز هر یک از توابع اصلی یک event مستقل صادر می شود.

-	محل قرار گیری تعریف ها، تابع ها و ... مطابق توصیه پروژه Fund-me

